Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ། །དཔའ་བོ་བཞིན་དུ་ཏིང་ངེ་འཛིན་གྱི་བྱ་བ་བྱེད་པ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་ཉམས་སུ་མྱོང་བར་བྱེད་པ་དང་། ཐམས་ཅད་དུ་ཁྱབ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ལ་དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་སྟེ།
en: The one that like a hero does the work of the meditative stabilizations, causes an experience of the range of all meditative stabilizations, and pervades them totally is called the śūraṅgama.

source: འདི་ལ་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་མི་རྟོག་པ་ཟག་པ་མེད་པ་འཇིག་རྟེན་ལས་འདས་པའི་སེམས་ནི་རྟོག་པ་དང་བཅས་པའི་བྱ་བ་མི་བྱེད་པ་དང་། རྣམ་པར་གཡེང་བ་མེད་པ་གཙོ་བོར་བྱེད་པའི་ཕྱིར་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ།
en: Nonconceptual, extraordinary states of mind without outflows of buddhas and bodhisattvas are called meditative stabilization because they privilege nondistraction and activity that is not carried out with thought construction.

source: །ཏིང་ངེ་འཛིན་དེ་ཡང་བསམ་གཏན་གྱི་ངོ་བོ་ཉིད་མ་ཡིན་ཏེ། བསམ་གཏན་ནི་གཟུགས་ཡོད་པ་ན་སྤྱོད་པར་གཏོགས་པའི་ཕྱིར་རོ།
en: Those meditative stabilizations are not concentrations, because concentrations are included in the activity of those who have form.

source: །སེམས་ཀྱི་བདག་ཉིད་དུ་གཅིག་ཏུ་ཟིན་ཀྱང་སྔོན་གྱི་བརྩལ་བའི་མཐུས་སོ་སོར་བྱེད་པ་ཕན་པས་ན། བྱ་བ་བྱེད་པའི་དབང་གིས་ཐ་དད་དུ་བརྗོད་དོ།
en: And even though they are one in their nature as states of mind, through the force of earlier endeavors, insofar as they are catalysts for different distinct activities they are set forth with different names governed by the work they do.

source: །དེ་ཡང་གཞན་དག་གིས་རྟོག་པའི་སྤྱོད་ཡུལ་དུ་མི་འགྱུར་ཏེ། སོ་སོར་རང་གིས་རིག་པ་ཡིན་པའི་ཕྱིར་རོ།
en: Furthermore, they are not within the range of others’ thought, because they are self-reflexive analytic knowledges.

source: །དེ་དག་ཀྱང་མདོ་ལས་ཇི་སྐད་འབྱུང་བ་བཞིན་དུ་གཟུང་བར་བྱ་སྟེ། དེ་ལ་རིགས་པས་དཔྱད་པར་བྱ་བ་ནི་མ་ཡིན་ནོ།
en: You should take them as they are said to be in the Sūtra, and not subject them to logical analysis. 4.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི་འདི་ལྟ་སྟེ།
en: Great Vehicle of the applications of mindfulness “Furthermore, Subhūti, the Great Vehicle of bodhisattva great beings is this: the four applications of mindfulness.”

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་སྟེ་ཞེས་བྱ་བ་ནི་འདི་ལ་དྲན་པ་ཉེ་བར་གནས་པས་ན། དྲན་པ་ཉེ་བར་གཞག་པ་ཞེས་བཤད་པའི་ཕྱིར། དྲན་པ་ཉེ་བར་གཞག་པ་ནི་ལུས་དང་། ཚོར་བ་དང་། སེམས་དང་ཆོས་ཞེས་བྱ་བ་དང་བཞི་ལ་དྲན་པ་ཉེ་བར་གཞག་པའི་སྒྲར་བརྗོད་དོ།
en: Here it is called a foundation of mindfulness because mindfulness is placed close by, hence the foundation is the four— “body… feeling… mind… and dharmas”— and they are referred to with the locution applications of mindfulness.

source: །དེ་ནི་དྲན་པ་ཡང་ཡིན་ལ། དྲན་པ་ཉེ་བར་གཞག་པ་ཡིན་པས་དྲན་པ་ཉེ་བར་གཞག་པའོ་ཞེས་བཤད་པའི་ཕྱིར་ཆོས་བཞིའི་ཡུལ་མ་བརྗེད་པ་དང་། བསྲུང་བའི་དོན་དུ་དྲན་པའི་བཞི་སྟེ།
en: It is mindfulness, and it is an application, so, since it is said to be an application of mindfulness, it is the four mindfulnesses for not forgetting and for guarding the objects of the four dharmas that are its objects.

source: དམིགས་པ་བཞིར་གྱུར་པའི་ཕྱིར་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཞེས་བྱའོ།
en: Because its objective supports are four it is called the four applications of mindfulness.

source: །འདི་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་འདི་བཞི་ཆར་ཐེག་པ་ཆེན་པོའི་ཚུལ་དུ་ནི་སྔར་བསྟན་ཏོ། །ལུས་དྲན་པ་ཉེ་བར་གཞག་པ་གཅིག་པུ་ནི་ཕྱིས་ཉན་ཐོས་ཀྱི་ཚུལ་དང་མཐུན་པར་རྣམ་པ་དྲུག་ཏུ་བསྟན་ཏེ།
en: Here the earlier teaching is about all four applications of mindfulness in the Great Vehicle system, and the latter is a teaching about the application of mindfulness to the body alone, in six parts in accord with the śrāvaka system. “

source: ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་ཞེས་བྱ་བ་ནི་གང་གི་ཚེ་ནང་གི་སེམས་ཅན་དུ་བགྲངས་པའི་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་དེའི་ཚེ་ན།
en: Dwell while viewing in a body the inner body”— the body is reckoned to be the inner being.

source: ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱའོ།
en: When they are viewing it, they are said to be “viewing in a body the inner body.”

source: །གང་གི་ཚེ་ཕྱི་རོལ་སེམས་ཅན་དུ་མི་བགྲང་བ། གཟུགས་ཀྱི་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་དེའི་ཚེ་ནི་ཕྱིའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱའོ།
en: When they are viewing the body of form that is outer, not reckoned to be the being, they are said to be “viewing in a body the outer body.”

source: །གང་གི་ཚེ་ཕྱིའི་སེམས་ཅན་དུ་བགྲང་བ། གཞན་གྱི་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་དེའི་ཚེ་ན་ནང་དང་ཕྱིའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱའོ།
en: When they are viewing somebody else’s body, reckoned to be an outer being, they are said to be “viewing in a body the inner and outer body.”

source: །གང་གི་ཚེ་ནང་གི་སེམས་ཅན་དུ་བགྲང་བའི་གཟུགས་ལ་དམིགས་ནས་ཚོར་བ་དང་སེམས་དང་། ཆོས་རྣམས་འབྱུང་བ་དེའི་ཚེ། ནང་གི་ཚོར་བ་དང་། ནང་གི་སེམས་དང་། ནང་གི་ཆོས་རྣམས་ལ་བྱའོ།
en: When, having taken the inner form reckoned to be the being as the objective support, feelings, mind, and dharmas arise, take them to be “inner feelings, inner mind, and inner dharmas.”

source: །གང་གི་ཚེ་ཕྱི་རོལ་སེམས་ཅན་དུ་མི་བགྲང་བའི་གཟུགས་ལ་དམིགས་པ་ལས་འབྱུང་བ་དེའི་ཚེ་ན་ཕྱིའི་ཚོར་བ་དང་། ཕྱིའི་སེམས་དང་། ཕྱིའི་ཆོས་རྣམས་ལ་ཞེས་བྱའོ།
en: When they arise from having taken the outer form not reckoned to be a being as the objective support, they are called “outer feelings, outer mind, and outer dharmas.”

source: །གང་གི་ཚེ་སེམས་ཅན་དུ་བགྲང་བ་གཞན་གྱི་གཟུགས་ལ་དམིགས་པ་ལས་བྱུང་བ་དེའི་ཚེ་ན་ཕྱི་ནང་གི་ཚོར་བ་དང་། ཕྱི་ནང་གི་སེམས་དང་། ཕྱི་ནང་གི་ཆོས་རྣམས་ལ་ཞེས་བྱའོ།
en: When they arise from having taken the form of somebody else counted as a being as the objective support, they are called “inner and outer feelings, inner and outer mind, and inner and outer dharmas.”

source: །ཡང་ན་སྐྱེ་མཆེད་དྲུག་ལ་དམིགས་པར་བྱེད་པ་ལ་ནི་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱ་བའོ། །དབང་པོར་མ་གཏོགས་ཤིང་མ་ཟིན་པ་ཕྱིའི་གཟུགས་ལ་དམིགས་པར་བྱེད་པ་དེ་ལ་ནི་ཕྱིའི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱའོ། །སྐྱེ་མཆེད་དྲུག་མ་གཏོགས་པར་ནང་གི་ཟིན་པའི་གཟུགས་ལ་དམིགས་པར་བྱེད་པ་ལ་ནི་ཕྱི་དང་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱའོ།
en: Alternatively, “while viewing in a body the inner body” is said to be when they take the six sense fields as their objective support; “while viewing in a body the outer body” is said to be when they take outer form not included in and not informed by the faculties as their objective support; and “viewing in a body the inner and outer body” is said to be when they take form not included in the six sense fields, but taken as inner, as their objective support.

source: །གཟུགས་དེ་གསུམ་ལ་དམིགས་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། སེམས་དང་། ཆོས་རྣམས་ཀྱང་རྣམ་པ་གསུམ་དུ་སྦྱར་བར་བྱའོ།
en: Connect the “feeling, mind, and dharmas” that have arisen from having taken those three forms as their objective support threefold as well.

source: །ཡང་ན་ནང་གི་འབྱུང་བའི་གཟུགས་རང་གི་ལུས་སུ་གཏོགས་པ་ལ་དམིགས་པར་བྱེད་པ་ལ་ནི་ནང་ཞེས་བྱའོ། །ཕྱིའི་གཞན་གྱི་འབྱུང་བ་ལ་དམིགས་པར་བྱེད་པ་ལ་ནི་ཕྱིའི་ཞེས་བྱའོ། །འབྱུང་བའི་གཟུགས་དེ་ཡང་རྒྱུར་བྱས་ནས་འབྱུང་བའི་དབང་པོ་དང་། ཡུལ་གྱི་གཟུགས་གང་ཡིན་པ་དེ་ལ་དམིགས་པར་བྱེད་པ་དེ་ལ་ནི་ཕྱི་ནང་གི་ཞེས་བྱའོ།
en: As another alternative, when taking the materiality of the inner elements included in one’s own body as the objective support it is called inner; when taking the outer elements of somebody else as the objective support it is called outer; and having made that materiality of the elements into the cause, when taking the elemental faculties and their objects as the objective support it is called inner and outer.

source: །འདི་གསུམ་ལ་དམིགས་པ་ལས་བྱུང་བའི་ཚོར་བ་དང་། སེམས་དང་། ཆོས་རྣམས་ལ་ཡང་རྣམ་པ་གསུམ་དུ་རིག་པར་བྱའོ། །ཡང་ན་གང་གི་ཚེ་རྣམ་པར་ཤེས་པ་དང་བཅས་པའི་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་དེའི་ཚེ་ན་ནང་གི་ལུས་དང་། ཚོར་བ་དང་སེམས་དང་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱའོ། །གང་གི་ཚེ་རྣམ་པར་ཤེ
en: Again, understand the “feeling, mind, and dharmas” that have arisen from having taken those three forms as their objective support threefold as well.

source: ས་པ་མེད་པ་རྣམ་པར་བསྔོས་པ་ལ་སོགས་པ་ལ་རྗེས་སུ་ལྟ་བ་དེའི་ཚེ་ན་ཕྱིའི་ལུས་དང་། ཚོར་བ་དང་། སེམས་དང་། ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱའོ། །གང་གི་ཚེ་རྣམ་པར་ཤེས་པ་མེད་པའི་རྣམ་པར་བསྔོས་པ་ལ་སོགས་པའི་གཟུགས་འདས་པའི་དུས་ན་རྣམ་པར་ཤེས་པ་དང་བཅས་པ་སྟེ། རྣམ་པར་ཤེས་པ་དང་བཅས་པའི་ལུས་འདི་ཡང་མ་འོངས་པའི་དུས་ན་རྣམ་པར་ཤེས་པ་མེད་པར་མཚུངས་པའི་ཆོས་ཉིད་དང་མཐུན་པའི་ཆོས་ཉིད་དུ་རྗེས་སུ་ལྟ་བ་དེའི་ཚེ་ན་ཕྱི་ནང་གི་ལུས་དང་། ཚོར་བ་དང་།
en: As another alternative, when they are viewing in a body an inner body that has consciousness they are said to be “viewing the inner body, feeling, mind, and dharmas”; when they are viewing the black and blue and so on, which has no consciousness, they are said to be “viewing outer body, feeling, mind, and dharmas”; and when they are viewing what is naturally happening to the form of a body that has no consciousness and is black and blue and so on, which had consciousness in the past, and the same thing naturally happening to this body that has consciousness, and which will also in the future have no consciousness, as equal, they are said to be “viewing inner and outer body, feeling, mind, and dharmas.” “

source: སེམས་དང་། ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱའོ། །ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བ་ཞེས་བྱ་བ་ནི་ནང་གི་ལུས་ལ་ལུས་ཞེས་བཏགས་པ་ཡིན་པར་རྗེས་སུ་བརྟགས་ནས་ལྟ་ཞིང་གནས་པ་སྟེ། གང་ཟག་ཡོད་པ་ཉིད་དམ། ཆོས་ཡོད་པ་ཉིད་དུ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བས་མི་དམིགས་པར་གནས་པས་གནས་སོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Viewing in a body the inner body” means they “dwell while viewing,” reflecting on an inner body labeledbody, that is they “dwell” dwelling by way of not apprehending anything—by way of not seeing an actual person there, or actual dharmas there.

source: །མི་དམིགས་པར་གནས་པ་དེ་ཉིད་བསྟན་པའི་ཕྱིར། ལུས་དང་ལྡན་པའི་རྣམ་པར་རྟོག་པ་རྣམས་ལ་རྣམ་པར་མི་རྟོག་གོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: To explicate dwelling by way of not apprehending anything, it says “without indulging in speculations to do with the body.”

source: །ལུས་སུ་འདུ་ཤེས་པ་དང་ལྡན་པའི་རྣམ་པར་རྟོག་པ་གང་ཡིན་པ་འདི་ནི་ལུས་སོ་ཞེས་བྱ་བའམ། རྟག་པ་དང་། མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། བདེ་བ་དང་། སྡུག་པ་དང་།
en: It means these “speculations” with the perception of it as “the body”: that it is “the body”; or that it is permanent, impermanent, pleasure, suffering, with a self, selfless, calm, not calm, empty, or not empty; or that it has a sign, is signless, is wished for, is wishless and so on.

source: མི་སྡུག་པ་དང་། བདག་དང་། བདག་མེད་པ་དང་། སྟོང་པ་དང་། མི་སྟོང་པ་དང་། མཚན་མ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་དང་། སྨོན་པ་མེད་པ་ལ་སོགས་པ་དེ་དག་ཏུ་རྣམ་པར་མི་རྟོག་གོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: They are “without indulging” those. “

source: །དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཞེས་བྱ་བ་ནི་དེ་ཡང་དེ་ལ་རྗེས་སུ་ལྟ་བ་དང་། རྣམ་པར་མི་རྟོག་པ་ནི་མི་དམིགས་པར་ཡིད་ལ་བྱེད་པའི་དབང་གིས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །བརྟུན་པ་ཅན་ཤེས་བཞིན་དང་། དྲན་པ་དང་ལྡན་ཞིང་འཇིག་རྟེན་གྱི་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས་ཞེས་བྱ་བ་ལ།
en: By way of not apprehending anything” means viewing based on paying attention to not apprehending anything and not speculating that it is this or that. “

source: རྒྱུན་དུ་སྦྱོར་བ་དང་། གུས་པར་སྦྱོར་བས་ཡང་དག་པར་མངོན་པར་བརྩོན་པའི་ཕྱིར་བརྟུན་པ་ཞེས་བྱའོ། །རྗེས་སུ་ལྟ་བའི་ཤེས་རབ་དང་། ཤེས་བཞིན་གྱིས་ཡང་དག་པར་ཡིད་ལ་བྱེད་པའི་ཕྱིར་ཤེས་བཞིན་ཞེས་བྱའོ། །མི་བརྗེད་པའི་བདག་ཉིད་དང་། སྲུང་བར་བྱེད་པ་དང་། གཡེང་བ་མེད་པར་བྱེད་པའི་དྲན་པ་དང་བཅས་པ་ལ་དྲན་པ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: Enthusiastic, introspective, mindful, having cleared away ordinary covetousness and depression”— they are “enthusiastic” because they apply themselves perfectly by practicing continually and practicing respectfully; “introspective” because they pay attention perfectly, viewing with wisdom and introspection; and “mindful” with the mindfulness that is not forgetting, that guards, and that prevents distraction.

source: །དེའི་འོག་ཏུ་བརྩོན་འགྲུས་དང་། ཤེས་རབ་དང་། དྲན་པ་དེ་དག་གི་ཕན་ཡོན་བསྟན་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་བརྣབ་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས་ཞེས་བྱ་བ་གསུངས་སོ།
en: Then, to teach the benefits of those—of perseverance, wisdom, and mindfulness—it says “having cleared away ordinary covetousness and depression.” “

source: །འཇིག་རྟེན་གྱི་ཆོས་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ལ་ཞེས་བྱ་བའི་ཐ་ཚིག་སྟེ། རྙེད་པ་དང་གྲགས་པ་དང་། བདེ་བ་དང་། བསྟོད་པ་ཞེས་བྱ་བ་འཇིག་རྟེན་གྱི་ཆོས་བཞི་ལ་ནི་ཆགས་སེམས་འབྱུང་ངོ་། །མ་རྙེད་པ་དང་།
en: Ordinary dharmas” mean ‘worldly dharmas’: the four of attaining, fame, pleasure, and praise, which give rise to mental attachment in an ordinary person; and the four of not attaining, infamy, blame, and pain, which give rise to depression.

source: མ་གྲགས་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྨད་པ་རྣམས་ལ་ནི་ཡིད་མི་བདེ་བ་ཞེས་འབྱུང་སྟེ། དེ་ལྟར་མི་དམིགས་པར་བསྒོམ་པ་ལ་བརྩོན་པ་ནི་འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱིས་མི་གོས་པར་བསྟན་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་བརྣབ་སེམས་དང་།
en: To teach that such enthusiasm for meditation without apprehending anything is not stained by any of the worldly dharmas, it says “having cleared away ordinary covetousness and depression.”

source: ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས་ཞེས་བྱ་བ་གསུངས་སོ། །ཡང་ན་གང་ཟག་དང་། ཆོས་རྣམས་མི་དམིགས་པའི་ཕྱིར་སེམས་ཅན་རྣམས་དང་། འདུ་བྱེད་རྣམས་ལ་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤངས་པར་བསྟན་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་བརྣབ་སེམས་དང་།
en: Alternatively, to teach that they have stopped attachment and anger toward beings and compounded things based on not apprehending persons or dharmas, it says “having cleared away ordinary covetousness and depression.”

source: ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ནས་ཞེས་བྱ་བ་གསུངས་སོ། །ཡང་ན་སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་ནང་ན་གཙོ་བོར་གྱུར་པ་འདོད་པ་ལ་འདུན་པ་དང་།
en: As another alternative, among all the obstructions, attachment that causes them to act on a desire for sense gratification, along with malice, are the main ones.

source: གནོད་སེམས་གཉིས་སྤངས་པར་བསྟན་པའི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱང་སྤངས་པར་བསྟན་པ་ཡིན་ནོ།
en: To teach that they have stopped them is to teach that they have stopped all the obstructions.

source: །དེ་བཞིན་དུ་ནང་གི་ཚོར་བ་རྣམས་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་ཞིང་ཞེས་བྱ་བ་ནི་བདེ་བ་དང་། སྡུག་བསྔལ་བ་དང་། བཏང་སྙོམས་ཀྱི་དབང་གིས་ཚོར་བ་རྣམ་པ་གསུམ་དུ་གྱུར་པ་ལས་ལུས་ཀྱི་ཚོར་བ་དང་། སེམས་ཀྱི་ཚོར་བའི་དབང་གིས་དྲུག་ཏུ་གྱུར་པ་དང་། ཟང་ཟིང་དང་བཅས་པ་དང་།
en: Similarly, “viewing in feelings inner feelings”— feelings are subdivided into the three feelings that come about based on happiness, suffering, and indifference, which are further subdivided into six based on physical and mental feelings, together with nonspiritual and spiritual ones, and those “based on greed and based on transcendence.”

source: ཟང་ཟིང་མེད་པ་དང་། ཞེན་པ་ལ་བརྟེན་པ་དང་། མངོན་པར་འབྱུང་བ་ལ་བརྟེན་པ་རྣམས་ཞེས་བྱ་བར་ཐ་དད་དུ་ཕྱེ་བའི་ཚོར་བ་རྣམས་ལ་ཚོར་བར་བརྟགས་པ་བཟུང་ནས། ཚོར་བ་པོ་བདག་གམ། ཆོས་ཡིན་པར་བརྟེན་པ་ལ་བལྟས་ནས་མི་དམིགས་པར་གནས་པས་གནས་སོ།
en: Having undertaken an analysis of them based on the one who feels being the self or the dharmas, having so viewed, they “dwell” dwelling by way of not apprehending anything.

source: །དེ་བཞིན་དུ་སེམས་ལ་ཡང་འདོད་ཆགས་དང་བཅས་པ་དང་། འདོད་ཆགས་མེད་པ་དང་། ཞེ་སྡང་དང་བཅས་པ་དང་། ཞེ་སྡང་མེད་པ་དང་། གཏི་མུག་དང་བཅས་པ་དང་། གཏི་མུག་མེད་པ་དང་།
en: Similarly, they “dwell while viewing” by way of not apprehending a self or dharmas, based on the division of mind into “a greedy state of mind and a mind free from greed, a mind with hate and free from hate, a mind with delusion and free from delusion, a mind collected and distracted,” and so on. “

source: བསྡུས་པ་དང་། རྣམ་པར་འཕྲོས་པ་ཞེས་བྱ་བ་ལ་སོགས་པར་དབྱེ་བས་ཕྱེ་བའི་སེམས་ལ་བརྟེན་ནས་བདག་གམ་ཆོས་མི་དམིགས་པའི་ཚུལ་གྱིས་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ།
en: In dharmas.”

source: །ཆོས་རྣམས་ལ་ཡང་ཕུང་པོ་དང་ཁམས་དང་། སྐྱེ་མཆེད་དང་། སྒྲིབ་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་།
en: Construe this as follows: In the aggregates, constituents, sense fields, obstructions, branches of awakening, noble truths and so on that are the dharmas.

source: འཕགས་པའི་བདེན་པ་ལ་སོགས་པའི་ཆོས་རྣམས་ལ་བརྟེན་ནས་ཀུན་བརྟགས་པའི་ཆོས་ཐམས་ཅད་མི་དམིགས་པར་སྙོམས་པར་འཇུག་པ་ལ་བསྒོམ་ཞིང་གནས་སོ་ཞེས་བྱ་བར་སྦྱར་བར་བྱའོ།
en: They “dwell” based on them. They meditate on entering into becoming absorbed in them, “not apprehending” any falsely imagined dharma.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པའི་ཚུལ་དུ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་བསྟན་ནས། ཉན་ཐོས་ཀྱི་ཚུལ་དུ་བསྟན་པའི་ཚུལ་གྱིས་ལུས་དྲན་པ་ཉེ་བར་གཞག་པ་ཉིད་རྣམ་པ་དྲུག་ཏུ་བསྟན་པར་བཞེད་ནས། དེའི་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་ན། སྤྱོད་ན་སྤྱོད་དོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ། སྤྱོད་ལམ་གྱི་སྒོ་དང་། ཤེས་བཞིན་གྱི་སྒོ་དང་།
en: Having thus taught the four applications of mindfulness in the bodhisattva vehicle system, wanting to teach in six parts just the application of mindfulness to the body by way of the teaching in the śrāvaka system, it says they “dwell, while viewing in a body the inner body, aware, when practicing, ‘I am practicing,’ ” and so on.

source: དབུགས་རྔུབ་པ་དང་འབྱུང་བའི་སྒོ་དང་། ཁམས་རྣམས་རྣམ་པར་གཞག་པའི་སྒོ་དང་། རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་ཀྱི་སྒོ་དང་། མི་སྡུག་པའི་སྒོ་དང་། སྒོ་དྲུག་པོ་དག་གིས་བསྟན་ཏོ།
en: It teaches from six points of view: from the viewpoint of the way they carry themselves, from the viewpoint of being clearly conscious, from the viewpoint of breathing in and breathing out, from the viewpoint of the presentation of the constituents, from the viewpoint of the thirty-two aspects, and from the viewpoint of the unpleasantnesses.

source: །དེ་ལ་དང་པོར་སྤྱོད་ལམ་གྱི་སྒོ་ནས་བསྟན་པ་ནི་སྤྱོད་པ་དང་། འགྲེང་བ་དང་འདུག་པ་དང་ཉལ་བ་ཞེས་བྱའོ།
en: There, first, teaching from the viewpoint of the way they carry themselves, it says “practicing… standing… sitting… and lying down.”

source: །སྤྱོད་ལམ་འདི་དག་ལ་རྣམ་པ་གསུམ་བསྟན་ཏེ། ཆེན་པོ་དང་འབྲིང་དང་ཆུང་ངུའོ།
en: It teaches these ways they carry themselves in three parts: big, middling, and small.

source: །གང་གི་ཚེ་ལམ་རིང་པོར་འགྲོ་བ་དེའི་ཚེ་སྤྱོད་ལམ་བཞི་ནི་ཆེ་བ་ཞེས་བྱ་སྟེ།
en: The four ways they carry themselves when going on a long path are termed big.

source: དེའི་དབང་གིས་འགྲེས་དང་པོ་བསྟན་ཏོ།
en: The first section of the text is an explanation based on that.

source: །གང་གི་ཚེ་བསོད་སྙོམས་ཀྱི་ཕྱིར་གྲོང་དུ་འཇུག་པའམ། གཙུག་ལག་ཁང་ནས་གཙུག་ལག་ཁང་གཞན་དག་ཏུ་དོན་གཉེར་དུ་འགྲོ་བ་དེའི་ཚེ་སྤྱོད་པའི་སྤྱོད་ལམ་བཞི་ནི་འབྲིང་པོ་སྟེ། དེའི་དབང་གིས་དེའི་དབང་དུ་འགྲོ་འམ། འོང་ཡང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན་ཞེས་བྱ་བས་ནི་གཉིས་པ་བསྟན་ཏོ།
en: The four ways they carry themselves when practicing during the period of entering a settlement to beg or when seeking to go from one temple to another temple are middling, and governed by that, “going out or coming back, clearly conscious of what they are doing” teaches the second.

source: །ལུས་ཀྱི་ཉམ་ང་བ་བསལ་བའི་ཕྱིར་བཤང་གཅི་ལ་སོགས་པའི་གནས་སུ་འགྲོ་བ་ལ་སོགས་པར་སྤྱོད་པའི་སྤྱོད་ལམ་བཞི་ནི་ཆུང་ངུ་སྟེ།
en: The four ways they carry themselves when going to physically relieve themselves—when going to a place to urinate or defecate and so on—are small.

source: དེའི་དབང་གིས་འགྲོ་བ་དང་། འགྲེང་བ་དང་། འདུག་པ་དང་། ཉལ་བ་ཞེས་བྱ་བས་བསྟན་ཏོ།
en: Based on that, “gone, stood, sat down, slept” teaches those. “

source: །ལྷག་མ་ཀུན་ཏུ་ལྟ་འམ། རྣམ་པར་ལྟ་ཡང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པས་ཆུང་ངུ་ཉིད་དོ།
en: When they have looked around or peered, they are clearly conscious of what they are doing,” and so on, is just small.

source: །དེ་ལ་བྱ་བ་བྱེད་པ་ཐམས་ཅད་ལ་ཡང་སོ་སོར་རྟོག་པ་རྣམ་པ་ལྔ་སྟེ། འདི་དང་འདི་བྱའོ་ཞེས་བྱ་བ་དང་། འདི་ནི་བྱའོ་འདི་ནི་མི་བྱའོ་ཞེས་བྱ་བ་དང་། འདི་ནི་དུས་ཡིན་ནོ་འདི་ནི་དུས་མ་ཡིན་ནོ་ཞེས་བྱ་བ་དང་། འདི་ལྟར་ནི་བྱའོ་འདི་ལྟར་མི་བྱའོ་ཞེས་བྱ་བ་དེའི་དོན་དུ་བྱའོ་ཞེས་བྱ་བ་སྟེ།
en: The carrying out of all activities is understood analytically in five ways: “I am doing this and that”; “I have to do this and I must not do that”; “this is the right time and that is the wrong time”; “I should do it like this and I should not do it like that”; and, “it should be done for that purpose.” “

source: དེ་ཡང་སྤྱོད་ན་སྤྱོད་དོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པས་བཤད་དོ།
en: Aware, when practicing, ‘I am practicing,’ ” and so on, is a further explanation of that.

source: །དེའི་འོག་ཏུ་སྤྱོད་ལམ་ཆུང་ངུའི་འགྲེས་ལ་འགྲོ་ཞེས་བྱ་བ་ནི་ཕར་ལ་འགྲོ་བའོ། །འོང་ཞེས་བྱ་བ་ནི་སླར་ལོག་པའོ།
en: And then, in the section of the passage on the small way they carry themselves, “going out” is going over there, and “coming back” is returning.

source: །བློ་སྔོན་དུ་མ་བཏང་བས་མ་བརྟགས་པར་གཟུགས་ལ་ལྟ་བ་ནི་ཀུན་ཏུ་ལྟ་བའོ། །བློ་སྔོན་དུ་བཏང་བས་བསྒྲིམས་ཏེ་གཟུགས་ལ་ལྟ་བ་ནི་རྣམ་པར་ལྟ་བའོ།
en: They “have looked around,” viewing form without thinking about it, without having made a prior decision to do so.

source: །ཡང་ན་མདུན་དུ་ལྟ་བ་ནི་ཀུན་ཏུ་ལྟ་བའོ། །ཕྱོགས་གཞན་དུ་ལྟ་བ་ནི་རྣམ་པར་ལྟ་བའོ།
en: Alternatively, “looking around” is looking in front; “peered” is looking in another direction. “

source: །དཔུང་པ་དང་། ལག་པ་དང་། རྐང་པ་དང་། ཡན་ལག་དང་། ཉིང་ལག་རྣམས་བྱ་བ་དེ་དང་དེ་དག་ལ་བསྡུས་པ་ནི་བསྐུམ་པའོ།
en: They have pulled in,” retracted, and “stretched out,” extended, their shoulders, arms, legs, limbs, and extremities in these or those activities.

source: །བསྲང་བ་ནི་བརྐྱང་བའོ། །ཆོས་གོས་ཆེན་པོ་ནི་སྣམ་སྦྱར་རོ། །དེ་ལས་གཞན་པའི་གོས་ནི་ཆོས་གོས་སོ།
en: Their large robe is the “under robe,” and the robes other than that are the “outer robe.”

source: །བསླང་བའི་སྣོད་ནི་ལྷུང་བཟེད་དོ།
en: The receptacle for alms is “a begging bowl.”

source: །ཟོས་པ་ནི་འབྲས་ཆན་ལ་སོགས་པའོ། །འཐུངས་པ་ནི་བཏུང་བ་ལ་སོགས་པའོ། །འཆོས་པ་ནི་ཁུར་བ་ལ་སོགས་པའོ། །མྱངས་པ་ནི་འོ་མ་དང་། ཞོ་དང་བུ་རམ་ལ་སོགས་པའོ།
en: They “have eaten” cooked rice and so on; “drunk” beverages and so on; have “chewed” vegetables and so on; and “savored” milk, yogurt, and molasses and so on.

source: །ལམ་དུ་འགྲོ་བ་ལ་སོགས་པའམ།
en: They are “overcome by drowsiness” at the wrong time, when traveling on a path and so on or when oppressed by the heat and so on.

source: ཚ་བས་གདུངས་པ་ལ་སོགས་པས་དུས་མ་ཡིན་པའི་གཉིད་ཀྱིས་ནོན་པ་ལ་ཕྱོགས་སུ་ལྟ་བ་དང་ཆུས་གདབ་པ་དང་། གདོང་ཕྱི་བ་ལ་སོགས་པ་ནི་གཙང་བའོ། །བཅག་པ་ལ་སོགས་པ་ནི་འགྲོ་བའོ། །བླ་མ་ལ་བསྙེན་བཀུར་བྱ་བ་ལ་སོགས་པ་ནི་འགྲེང་བའོ། །སྐྱིལ་མོ་ཀྲུང་ལ་སོགས་པ་ནི་འདུག་པའོ།
en: It is “warded off” by gazing off into the directions and so on, splashing water and so on, and wiping the face and so on.

source: །དུས་སུ་སེང་གེའི་ཉལ་ཐབས་སུ་ཉལ་བ་ནི་ཉལ་བའོ། །མེལ་ཚེ་ཐུན་ལྔ་ནི་གཉིད་ཀྱིས་མ་ལོག་པའོ། །ཆོས་འཆད་པའི་ཡང་དག་པའི་གཏམ་ལ་སོགས་པ་ནི་སྨྲ་བའོ། །ཇི་ལྟར་ཐོས་ཤིང་བཟུང་བའི་ཆོས་རྣམས་ཀྱི་དོན་སེམས་ཤིང་འཇལ་བ་ལ་སོགས་པ་ནི་མི་སྨྲ་བའོ། །ལྷག་མཐོང་དང་ཞི་གནས་ལ་མངོན་པར་བརྩོན་པ་ནི་ནང་དུ་ཡང་དག་པར་འཇོག་ཅེས་བྱའོ།
en: They have “gone” treading and so on; “stood” attending on a guru and so on; “sat down” in a cross-legged posture and so on; “slept” by sleeping at the right time in the way a lion sleeps; “awoken” by not falling asleep during a period of five watches; “spoken” perfect discourses explaining the doctrine; “remained silent,” thinking about and pondering, and so on, the meaning of the doctrines heard and taken up in the mind; and are “withdrawn for meditation” when working hard at insight and calm abiding.

source: །དབུགས་རྔུབ་པ་དང་འབྱུང་བའི་སྒོ་གསུམ་ལ་དྲན་བཞིན་དུ་དབུགས་རྔུབས་ན་དྲན་བཞིན་དུ་དབུགས་རྔུབས་སོ་སྙམ་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ་ཞེས་བྱ་བ་ནི་དྲན་པ་དང་།
en: In regard to the third viewpoint of breathing in and breathing out, it says they “are mindful when breathing in, aware of the fact ‘I am breathing in’; are mindful when breathing out, aware of the fact ‘I am breathing out.’

source: ཤེས་བཞིན་གཙོ་བོར་བྱས་ཏེ། ལེགས་པར་ནན་ཏན་དུ་དབུགས་རྔུབས་སོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means they make mindfulness and introspection primary and concentrate well on ‘I am breathing in.’ “

source: །དབུགས་རིང་དུ་རྔུབས་ན་དབུགས་རིང་དུ་རྔུབས་སོ་སྙམ་དུ་ཞེས་བྱ་བ་ནི་གང་གི་ཚེ་ལས་དང་པོ་པ་འདི་དྲན་པ་དང་།
en: When breathing in long, [they] are aware of the fact ‘I am breathing in long.’ ”

source: ཤེས་བཞིན་དུ་དྲན་པ་ལ་བརྩོན་པར་བྱེད་པ་ན་དེའི་ལུས་དང་། སེམས་ཤིན་ཏུ་སྦྱངས་པ་ན་དབུགས་རྔུབ་པ་དང་།
en: When beginners are persevering at mindfulness and introspection their body and mind become pliant and the in and out breaths gradually become more and more subtle.

source: འབྱུང་བ་དག་རིམ་གྱིས་ཕྲ་བར་གྱུར་ཅིང་རྟོགས་པར་དཀའ་བར་གྱུར་པ་དེའི་ཚེ།
en: It becomes more and more difficult to pay attention.

source: རྣལ་འབྱོར་པ་དག་གིས་དབུགས་རིང་དུ་བྱས་ནས་རྟོགས་པར་བྱེད་དོ།
en: At that point practitioners lengthen their breath and make themselves pay attention.
